package com.prodius.module3.lesson17hw.zoo;

public class ZooManager {
    /*
    Реализуйте класс ZooManager, который будет управлять несколькими зоопарками.
     Каждый зоопарк должен храниться в отдельном экземпляре класса Zoo.
     Реализуйте методы добавления и удаления зоопарков из списка,
     а также методы для получения списка всех животных и сортировки животных
     по именам в алфавитном порядке из всех зоопарков. В классе ZooManager
     используйте Generics для работы со списками зоопарков и животных.
     */
}
